In [1]:
import pandas as pd
import numpy as np

In [4]:
sp=pd.Series({"the":1,1:2,36:"th",8:9})
sp

the     1
1       2
36     th
8       9
dtype: object

In [5]:
type(sp)

pandas.core.series.Series

In [6]:
sp1=pd.Series([1,1,36,8],name="Bluebell",dtype="int16")
sp1

0     1
1     1
2    36
3     8
Name: Bluebell, dtype: int16

In [8]:
ind=[1,2,3,4]
sp1=pd.Series([1,1,36,8],index=ind,name="Bluebell",dtype="int16")
sp1

1     1
2     1
3    36
4     8
Name: Bluebell, dtype: int16

In [9]:
dates=pd.date_range('20190204',periods=6)
dates

DatetimeIndex(['2019-02-04', '2019-02-05', '2019-02-06', '2019-02-07',
               '2019-02-08', '2019-02-09'],
              dtype='datetime64[ns]', freq='D')

In [10]:
import numpy as np
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2019-02-04  0.618430  0.247862  0.052134 -0.570725
2019-02-05  0.706420 -0.371081 -1.413554 -1.505596
2019-02-06 -2.593135  0.057471  1.364642  0.466238
2019-02-07 -0.417490 -0.340535  0.247393 -0.697694
2019-02-08 -0.841695 -0.077997 -1.049247 -0.665778
2019-02-09  0.123326  0.734372  0.445265  0.300773

In [11]:
df2 = pd.DataFrame({'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo' })
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [26]:
np.array([1,2]*3)
np.array([1,2])*3

array([3, 6])

In [35]:
#ind=[1,2,3,4]
sp22=pd.Series({"the":1,1:2,36:"th",8:9})
sp22

the     1
1       2
36     th
8       9
dtype: object

In [36]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [38]:
df2.head(1)

     A          B    C  D     E    F
0  1.0 2013-01-02  1.0  3  test  foo

In [39]:
df2.tail(1)

     A          B    C  D      E    F
3  1.0 2013-01-02  1.0  3  train  foo

In [40]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [41]:
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [42]:
df2.describe()

         A    C    D
count  4.0  4.0  4.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

In [43]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      float64
 1   B       4 non-null      datetime64[ns]
 2   C       4 non-null      float32
 3   D       4 non-null      int32
 4   E       4 non-null      category
 5   F       4 non-null      object
dtypes: category(1), datetime64[ns](1), float32(1), float64(1), int32(1), object(1)
memory usage: 260.0+ bytes

In [45]:
df2.T

,0,1,2,3
A,1,1,1,1
B,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00
C,1,1,1,1
D,3,3,3,3
E,test,train,test,train
F,foo,foo,foo,foo

In [46]:
df2.T.describe()

          0    1    2    3
count   6.0  6.0  6.0  6.0
unique  5.0  5.0  5.0  5.0
top     1.0  1.0  1.0  1.0
freq    2.0  2.0  2.0  2.0

In [48]:
df2.T.info()

<class 'pandas.core.frame.DataFrame'>
Index: 6 entries, A to F
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       6 non-null      object
 1   1       6 non-null      object
 2   2       6 non-null      object
 3   3       6 non-null      object
dtypes: object(4)
memory usage: 400.0+ bytes

In [52]:
df2.sort_index(axis=0,ascending=False)

     A          B    C  D      E    F
3  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
0  1.0 2013-01-02  1.0  3   test  foo

In [53]:
df2.sort_index(axis=1,ascending=False)

     F      E  D    C          B    A
0  foo   test  3  1.0 2013-01-02  1.0
1  foo  train  3  1.0 2013-01-02  1.0
2  foo   test  3  1.0 2013-01-02  1.0
3  foo  train  3  1.0 2013-01-02  1.0

In [54]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [55]:
df

                   A         B         C         D
2019-02-04 -0.567306  0.015351  0.275385  0.503258
2019-02-05 -2.643626 -0.242701 -0.631328 -0.267567
2019-02-06 -0.876102 -0.136487 -0.155861  1.954258
2019-02-07  1.498030 -0.742463  0.755534  2.669641
2019-02-08 -0.582625 -2.255273 -0.362545 -0.295898
2019-02-09  1.153602 -0.426750 -1.574657  0.321713

In [58]:
df.sort_values(by="C",inplace=True)
df

                   A         B         C         D
2019-02-09  1.153602 -0.426750 -1.574657  0.321713
2019-02-05 -2.643626 -0.242701 -0.631328 -0.267567
2019-02-08 -0.582625 -2.255273 -0.362545 -0.295898
2019-02-06 -0.876102 -0.136487 -0.155861  1.954258
2019-02-04 -0.567306  0.015351  0.275385  0.503258
2019-02-07  1.498030 -0.742463  0.755534  2.669641

In [59]:
df

                   A         B         C         D
2019-02-09  1.153602 -0.426750 -1.574657  0.321713
2019-02-05 -2.643626 -0.242701 -0.631328 -0.267567
2019-02-08 -0.582625 -2.255273 -0.362545 -0.295898
2019-02-06 -0.876102 -0.136487 -0.155861  1.954258
2019-02-04 -0.567306  0.015351  0.275385  0.503258
2019-02-07  1.498030 -0.742463  0.755534  2.669641

In [60]:
df.A

2019-02-09    1.153602
2019-02-05   -2.643626
2019-02-08   -0.582625
2019-02-06   -0.876102
2019-02-04   -0.567306
2019-02-07    1.498030
Name: A, dtype: float64

In [12]:
df[0:3]

                   A         B         C         D
2019-02-04  0.618430  0.247862  0.052134 -0.570725
2019-02-05  0.706420 -0.371081 -1.413554 -1.505596
2019-02-06 -2.593135  0.057471  1.364642  0.466238

In [33]:
df['20190204':'20190204']

                  A         B         C         D
2019-02-04  0.61843  0.247862  0.052134 -0.570725

In [39]:
df[]

'2019-02-04    0.618430\n2019-02-05    0.706420\n2019-02-06   -2.593135\n2019-02-07   -0.417490\n2019-02-08   -0.841695\n2019-02-09    0.123326\nFreq: D, Name: A, dtype: float642019-02-04    0.247862\n2019-02-05   -0.371081\n2019-02-06    0.057471\n2019-02-07   -0.340535\n2019-02-08   -0.077997\n2019-02-09    0.734372\nFreq: D, Name: B, dtype: float64'

In [59]:
safari=pd.Series([1.0,23,4])
safari

0     1.0
1    23.0
2     4.0
dtype: float64

In [63]:
safari.values[1]=677
safari

0      1.0
1    677.0
2      4.0
dtype: float64

<bound method Series.count of 0      1.0
1    677.0
2      4.0
dtype: float64>

In [70]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [71]:
df.index

DatetimeIndex(['2019-02-04', '2019-02-05', '2019-02-06', '2019-02-07',
               '2019-02-08', '2019-02-09'],
              dtype='datetime64[ns]', freq='D')

In [72]:
df.sort_values(by=['A','B' ], ascending=False)# sort based on A first Then Based on B

                   A         B         C         D
2019-02-05  0.706420 -0.371081 -1.413554 -1.505596
2019-02-04  0.618430  0.247862  0.052134 -0.570725
2019-02-09  0.123326  0.734372  0.445265  0.300773
2019-02-07 -0.417490 -0.340535  0.247393 -0.697694
2019-02-08 -0.841695 -0.077997 -1.049247 -0.665778
2019-02-06 -2.593135  0.057471  1.364642  0.466238

In [74]:
df.sort_values(by=['A','B' ], ascending=[False,True])# A sorted ascending B sorted descending

                   A         B         C         D
2019-02-05  0.706420 -0.371081 -1.413554 -1.505596
2019-02-04  0.618430  0.247862  0.052134 -0.570725
2019-02-09  0.123326  0.734372  0.445265  0.300773
2019-02-07 -0.417490 -0.340535  0.247393 -0.697694
2019-02-08 -0.841695 -0.077997 -1.049247 -0.665778
2019-02-06 -2.593135  0.057471  1.364642  0.466238

In [77]:
df.sort_values(by='20190206' ,axis=1, ascending=False)

                   C         D         B         A
2019-02-04  0.052134 -0.570725  0.247862  0.618430
2019-02-05 -1.413554 -1.505596 -0.371081  0.706420
2019-02-06  1.364642  0.466238  0.057471 -2.593135
2019-02-07  0.247393 -0.697694 -0.340535 -0.417490
2019-02-08 -1.049247 -0.665778 -0.077997 -0.841695
2019-02-09  0.445265  0.300773  0.734372  0.123326

2019-02-06 1.364642 0.466238 0.057471 -2.593135 ## thisectror is sorted via column

In [79]:
df.loc[dates[0:4]]

                   A         B         C         D
2019-02-04  0.618430  0.247862  0.052134 -0.570725
2019-02-05  0.706420 -0.371081 -1.413554 -1.505596
2019-02-06 -2.593135  0.057471  1.364642  0.466238
2019-02-07 -0.417490 -0.340535  0.247393 -0.697694

In [85]:
df.loc['20190102':'20190205',['A','B']]#Even though this date no there it will display all values between 20190102 to 20190205

                  A         B
2019-02-04  0.61843  0.247862
2019-02-05  0.70642 -0.371081

In [82]:
df

                   A         B         C         D
2019-02-04  0.618430  0.247862  0.052134 -0.570725
2019-02-05  0.706420 -0.371081 -1.413554 -1.505596
2019-02-06 -2.593135  0.057471  1.364642  0.466238
2019-02-07 -0.417490 -0.340535  0.247393 -0.697694
2019-02-08 -0.841695 -0.077997 -1.049247 -0.665778
2019-02-09  0.123326  0.734372  0.445265  0.300773

In [88]:
df.loc['20190204',['A','B']]

A    0.618430
B    0.247862
Name: 2019-02-04 00:00:00, dtype: float64

In [92]:
df.loc['20190204',['A']]

A    0.61843
Name: 2019-02-04 00:00:00, dtype: float64

In [93]:
type(df.loc['20190204',['A']])#Series

pandas.core.series.Series

In [94]:
type(df.loc['20190204','A'])#scalar

numpy.float64

In [96]:
type(df.loc['20190102':'20190205',['A','B']])#Data Frame

pandas.core.frame.DataFrame

In [100]:
df.at[dates[0],'A']#much faster

0.6184300756334401

In [98]:
df

                   A         B         C         D
2019-02-04  0.618430  0.247862  0.052134 -0.570725
2019-02-05  0.706420 -0.371081 -1.413554 -1.505596
2019-02-06 -2.593135  0.057471  1.364642  0.466238
2019-02-07 -0.417490 -0.340535  0.247393 -0.697694
2019-02-08 -0.841695 -0.077997 -1.049247 -0.665778
2019-02-09  0.123326  0.734372  0.445265  0.300773

In [101]:
df.iloc[3]

A   -0.417490
B   -0.340535
C    0.247393
D   -0.697694
Name: 2019-02-07 00:00:00, dtype: float64

In [102]:
df

                   A         B         C         D
2019-02-04  0.618430  0.247862  0.052134 -0.570725
2019-02-05  0.706420 -0.371081 -1.413554 -1.505596
2019-02-06 -2.593135  0.057471  1.364642  0.466238
2019-02-07 -0.417490 -0.340535  0.247393 -0.697694
2019-02-08 -0.841695 -0.077997 -1.049247 -0.665778
2019-02-09  0.123326  0.734372  0.445265  0.300773

In [103]:
df.iloc[3]

pandas.core.series.Series

In [104]:
df.iloc[3:5,2:4]

                   C         D
2019-02-07  0.247393 -0.697694
2019-02-08 -1.049247 -0.665778

In [105]:
df.iloc[3,2]

0.24739281611953315

In [106]:
df.iloc[3:5,2:4]

                   C         D
2019-02-07  0.247393 -0.697694
2019-02-08 -1.049247 -0.665778

In [107]:
df.loc[dates[0:3]]# it auto sorts and displays

                   A         B         C         D
2019-02-04  0.618430  0.247862  0.052134 -0.570725
2019-02-05  0.706420 -0.371081 -1.413554 -1.505596
2019-02-06 -2.593135  0.057471  1.364642  0.466238

In [108]:
df.iat[3,2]#much faster

0.24739281611953315

In [112]:
df.iloc[:,0:2]>0

                A      B
2019-02-04   True   True
2019-02-05   True  False
2019-02-06  False   True
2019-02-07  False  False
2019-02-08  False  False
2019-02-09   True   True

In [111]:
df[df.A>0]

                   A         B         C         D
2019-02-04  0.618430  0.247862  0.052134 -0.570725
2019-02-05  0.706420 -0.371081 -1.413554 -1.505596
2019-02-09  0.123326  0.734372  0.445265  0.300773

In [113]:
df.A

2019-02-04    0.618430
2019-02-05    0.706420
2019-02-06   -2.593135
2019-02-07   -0.417490
2019-02-08   -0.841695
2019-02-09    0.123326
Freq: D, Name: A, dtype: float64

In [114]:
df[df.iloc[:,0:2]>0]

                   A         B   C   D
2019-02-04  0.618430  0.247862 NaN NaN
2019-02-05  0.706420       NaN NaN NaN
2019-02-06       NaN  0.057471 NaN NaN
2019-02-07       NaN       NaN NaN NaN
2019-02-08       NaN       NaN NaN NaN
2019-02-09  0.123326  0.734372 NaN NaN

In [118]:
df[(df.A>0) & (df.B>0)]

                   A         B         C         D
2019-02-04  0.618430  0.247862  0.052134 -0.570725
2019-02-09  0.123326  0.734372  0.445265  0.300773

In [119]:
df[(df.A>0) | (df.B>0)]

                   A         B         C         D
2019-02-04  0.618430  0.247862  0.052134 -0.570725
2019-02-05  0.706420 -0.371081 -1.413554 -1.505596
2019-02-06 -2.593135  0.057471  1.364642  0.466238
2019-02-09  0.123326  0.734372  0.445265  0.300773

In [120]:
df.iloc[3,2]=np.NaN

In [121]:
df

                   A         B         C         D
2019-02-04  0.618430  0.247862  0.052134 -0.570725
2019-02-05  0.706420 -0.371081 -1.413554 -1.505596
2019-02-06 -2.593135  0.057471  1.364642  0.466238
2019-02-07 -0.417490 -0.340535       NaN -0.697694
2019-02-08 -0.841695 -0.077997 -1.049247 -0.665778
2019-02-09  0.123326  0.734372  0.445265  0.300773

In [122]:
df.iloc[3,2]==np.NaN# because on not anumber not equal to another not a number since it is numpy value

False

In [123]:
np.isnan(df.iloc[3,2])

True

In [124]:
df

                   A         B         C         D
2019-02-04  0.618430  0.247862  0.052134 -0.570725
2019-02-05  0.706420 -0.371081 -1.413554 -1.505596
2019-02-06 -2.593135  0.057471  1.364642  0.466238
2019-02-07 -0.417490 -0.340535       NaN -0.697694
2019-02-08 -0.841695 -0.077997 -1.049247 -0.665778
2019-02-09  0.123326  0.734372  0.445265  0.300773

In [125]:
df3=df.copy()

In [127]:
df3['D']=[1,2,3,4,5,6]
df3

                   A         B         C  D
2019-02-04  0.618430  0.247862  0.052134  1
2019-02-05  0.706420 -0.371081 -1.413554  2
2019-02-06 -2.593135  0.057471  1.364642  3
2019-02-07 -0.417490 -0.340535       NaN  4
2019-02-08 -0.841695 -0.077997 -1.049247  5
2019-02-09  0.123326  0.734372  0.445265  6

In [130]:
df3['D'].isin([3,4])

2019-02-04    False
2019-02-05    False
2019-02-06     True
2019-02-07     True
2019-02-08    False
2019-02-09    False
Freq: D, Name: D, dtype: bool

In [131]:
df3['E']=[13,23,34,44,59,76]#added new column

In [132]:
df3

                   A         B         C  D   E
2019-02-04  0.618430  0.247862  0.052134  1  13
2019-02-05  0.706420 -0.371081 -1.413554  2  23
2019-02-06 -2.593135  0.057471  1.364642  3  34
2019-02-07 -0.417490 -0.340535       NaN  4  44
2019-02-08 -0.841695 -0.077997 -1.049247  5  59
2019-02-09  0.123326  0.734372  0.445265  6  76

In [137]:
st=pd.Series([1,2,4,5,6,7],index=pd.date_range('20190205',periods=6))

In [138]:
df3['F']=st

In [139]:
df3# here first value of F column is NaN bcoz st started from 2019-02-05

                   A         B         C  D   E    F
2019-02-04  0.618430  0.247862  0.052134  1  13  NaN
2019-02-05  0.706420 -0.371081 -1.413554  2  23  1.0
2019-02-06 -2.593135  0.057471  1.364642  3  34  2.0
2019-02-07 -0.417490 -0.340535       NaN  4  44  4.0
2019-02-08 -0.841695 -0.077997 -1.049247  5  59  5.0
2019-02-09  0.123326  0.734372  0.445265  6  76  6.0

In [140]:
df3.loc['20190205','B']=67

In [141]:
df3

                   A          B         C  D   E    F
2019-02-04  0.618430   0.247862  0.052134  1  13  NaN
2019-02-05  0.706420  67.000000 -1.413554  2  23  1.0
2019-02-06 -2.593135   0.057471  1.364642  3  34  2.0
2019-02-07 -0.417490  -0.340535       NaN  4  44  4.0
2019-02-08 -0.841695  -0.077997 -1.049247  5  59  5.0
2019-02-09  0.123326   0.734372  0.445265  6  76  6.0

In [143]:
df3.iloc[1,1]=65
df3

                   A          B         C  D   E    F
2019-02-04  0.618430   0.247862  0.052134  1  13  NaN
2019-02-05  0.706420  65.000000 -1.413554  2  23  1.0
2019-02-06 -2.593135   0.057471  1.364642  3  34  2.0
2019-02-07 -0.417490  -0.340535       NaN  4  44  4.0
2019-02-08 -0.841695  -0.077997 -1.049247  5  59  5.0
2019-02-09  0.123326   0.734372  0.445265  6  76  6.0

In [145]:
df3.iat[1,1]=445
df3

                   A           B         C  D   E    F
2019-02-04  0.618430    0.247862  0.052134  1  13  NaN
2019-02-05  0.706420  445.000000 -1.413554  2  23  1.0
2019-02-06 -2.593135    0.057471  1.364642  3  34  2.0
2019-02-07 -0.417490   -0.340535       NaN  4  44  4.0
2019-02-08 -0.841695   -0.077997 -1.049247  5  59  5.0
2019-02-09  0.123326    0.734372  0.445265  6  76  6.0

In [147]:
df3.loc[:,'C']

2019-02-04    0.052134
2019-02-05   -1.413554
2019-02-06    1.364642
2019-02-07         NaN
2019-02-08   -1.049247
2019-02-09    0.445265
Freq: D, Name: C, dtype: float64

In [149]:
df3.reindex(index=df3.index[0:4],columns=list(df3.columns)+['G'])# mentioned index are included rest is dropped additional columns are given NaN value

                   A           B         C  D   E    F   G
2019-02-04  0.618430    0.247862  0.052134  1  13  NaN NaN
2019-02-05  0.706420  445.000000 -1.413554  2  23  1.0 NaN
2019-02-06 -2.593135    0.057471  1.364642  3  34  2.0 NaN
2019-02-07 -0.417490   -0.340535       NaN  4  44  4.0 NaN

In [153]:
df3.reindex(index=df3.index[0:4],columns=list(df3.columns)+['G'])

                   A           B         C  D   E    F   G
2019-02-04  0.618430    0.247862  0.052134  1  13  NaN NaN
2019-02-05  0.706420  445.000000 -1.413554  2  23  1.0 NaN
2019-02-06 -2.593135    0.057471  1.364642  3  34  2.0 NaN
2019-02-07 -0.417490   -0.340535       NaN  4  44  4.0 NaN

In [154]:
df3.dropna(how='any')

                   A           B         C  D   E    F
2019-02-05  0.706420  445.000000 -1.413554  2  23  1.0
2019-02-06 -2.593135    0.057471  1.364642  3  34  2.0
2019-02-08 -0.841695   -0.077997 -1.049247  5  59  5.0
2019-02-09  0.123326    0.734372  0.445265  6  76  6.0

In [155]:
df3

                   A           B         C  D   E    F
2019-02-04  0.618430    0.247862  0.052134  1  13  NaN
2019-02-05  0.706420  445.000000 -1.413554  2  23  1.0
2019-02-06 -2.593135    0.057471  1.364642  3  34  2.0
2019-02-07 -0.417490   -0.340535       NaN  4  44  4.0
2019-02-08 -0.841695   -0.077997 -1.049247  5  59  5.0
2019-02-09  0.123326    0.734372  0.445265  6  76  6.0

In [156]:
df4=df3.reindex(index=df3.index[0:],columns=list(df3.columns)+['G']).copy()

In [157]:
df4

                   A           B         C  D   E    F   G
2019-02-04  0.618430    0.247862  0.052134  1  13  NaN NaN
2019-02-05  0.706420  445.000000 -1.413554  2  23  1.0 NaN
2019-02-06 -2.593135    0.057471  1.364642  3  34  2.0 NaN
2019-02-07 -0.417490   -0.340535       NaN  4  44  4.0 NaN
2019-02-08 -0.841695   -0.077997 -1.049247  5  59  5.0 NaN
2019-02-09  0.123326    0.734372  0.445265  6  76  6.0 NaN

In [158]:
df4.dropna(how='any',axis=1)

                   A           B  D   E
2019-02-04  0.618430    0.247862  1  13
2019-02-05  0.706420  445.000000  2  23
2019-02-06 -2.593135    0.057471  3  34
2019-02-07 -0.417490   -0.340535  4  44
2019-02-08 -0.841695   -0.077997  5  59
2019-02-09  0.123326    0.734372  6  76

In [159]:
df4.dropna(how='all',axis=1)

                   A           B         C  D   E    F
2019-02-04  0.618430    0.247862  0.052134  1  13  NaN
2019-02-05  0.706420  445.000000 -1.413554  2  23  1.0
2019-02-06 -2.593135    0.057471  1.364642  3  34  2.0
2019-02-07 -0.417490   -0.340535       NaN  4  44  4.0
2019-02-08 -0.841695   -0.077997 -1.049247  5  59  5.0
2019-02-09  0.123326    0.734372  0.445265  6  76  6.0

In [162]:
df4.fillna(method='ffill')#filled by values prior or above

                   A           B         C  D   E    F   G
2019-02-04  0.618430    0.247862  0.052134  1  13  NaN NaN
2019-02-05  0.706420  445.000000 -1.413554  2  23  1.0 NaN
2019-02-06 -2.593135    0.057471  1.364642  3  34  2.0 NaN
2019-02-07 -0.417490   -0.340535  1.364642  4  44  4.0 NaN
2019-02-08 -0.841695   -0.077997 -1.049247  5  59  5.0 NaN
2019-02-09  0.123326    0.734372  0.445265  6  76  6.0 NaN

In [163]:
df4

                   A           B         C  D   E    F   G
2019-02-04  0.618430    0.247862  0.052134  1  13  NaN NaN
2019-02-05  0.706420  445.000000 -1.413554  2  23  1.0 NaN
2019-02-06 -2.593135    0.057471  1.364642  3  34  2.0 NaN
2019-02-07 -0.417490   -0.340535       NaN  4  44  4.0 NaN
2019-02-08 -0.841695   -0.077997 -1.049247  5  59  5.0 NaN
2019-02-09  0.123326    0.734372  0.445265  6  76  6.0 NaN

In [164]:
df4.fillna(method='bfill')#filled by values below

                   A           B         C  D   E    F   G
2019-02-04  0.618430    0.247862  0.052134  1  13  1.0 NaN
2019-02-05  0.706420  445.000000 -1.413554  2  23  1.0 NaN
2019-02-06 -2.593135    0.057471  1.364642  3  34  2.0 NaN
2019-02-07 -0.417490   -0.340535 -1.049247  4  44  4.0 NaN
2019-02-08 -0.841695   -0.077997 -1.049247  5  59  5.0 NaN
2019-02-09  0.123326    0.734372  0.445265  6  76  6.0 NaN

In [165]:
df4.fillna(67)

                   A           B          C  D   E     F     G
2019-02-04  0.618430    0.247862   0.052134  1  13  67.0  67.0
2019-02-05  0.706420  445.000000  -1.413554  2  23   1.0  67.0
2019-02-06 -2.593135    0.057471   1.364642  3  34   2.0  67.0
2019-02-07 -0.417490   -0.340535  67.000000  4  44   4.0  67.0
2019-02-08 -0.841695   -0.077997  -1.049247  5  59   5.0  67.0
2019-02-09  0.123326    0.734372   0.445265  6  76   6.0  67.0

In [3]:
pd.Series?

In [5]:
sp=pd.Series({"the":1,1:2,36:"th",8:9})

In [6]:
sp1=pd.Series([1,2,34,0])
sp1

0     1
1     2
2    34
3     0
dtype: int64

In [7]:
sp

the     1
1       2
36     th
8       9
dtype: object

In [13]:
sp2=pd.Series(np.array([1,23,5,6]))
sp2

0     1
1    23
2     5
3     6
dtype: int32

In [17]:
sp3=pd.Series(3,index=list(range(5)))
sp3

0    3
1    3
2    3
3    3
4    3
dtype: int64

In [18]:
sp.index

Index(['the', 1, 36, 8], dtype='object')

In [41]:
sp.values

array([1, 2, 'th', 9], dtype=object)

In [55]:
sp1=pd.Series(range(4),dtype='float32')
sp1

0    0.0
1    1.0
2    2.0
3    3.0
dtype: float32

In [63]:
type(sp1.values)

numpy.ndarray

In [3]:
spp=pd.Series({'a':'theof','b':[1,2,3,5,7],'c':np.arange(4).reshape(2,2)},name="Yeppy")
spp

a               theof
b     [1, 2, 3, 5, 7]
c    [[0, 1], [2, 3]]
Name: Yeppy, dtype: object

In [88]:
np.hsplit(spp.c,(1,2))

[array([[0],
        [2]]),
 array([[1],
        [3]]),
 array([], shape=(2, 0), dtype=int32)]

In [89]:
spp.index

Index(['a', 'b', 'c'], dtype='object')

In [4]:
spp.a

'theof'

In [5]:
spp.a[2]

'e'

In [8]:
np.random.randn?

In [10]:
dates = pd.date_range('20130101', periods=6)
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.408856 -0.977874  0.411755 -0.814856
2013-01-02 -0.244975 -2.588626 -0.401251 -0.309654
2013-01-03 -0.204894  0.035694 -2.304873 -0.676617
2013-01-04 -0.718461 -1.666888  0.293994 -0.927001
2013-01-05 -0.220124  0.765427  0.369876 -0.044518
2013-01-06 -1.934031  2.235052 -1.786364 -0.063985

In [12]:

type(df.values)

numpy.ndarray

In [22]:
cl=['Name','Strength','Rank']
df = pd.DataFrame([['africa',145,45],['america',1000,3],['India',782,1],['Iran',345,34],['SA',222,56],['Aus',123,29]], index=dates, columns=cl)

In [23]:
df

               Name  Strength  Rank
2013-01-01   africa       145    45
2013-01-02  america      1000     3
2013-01-03    India       782     1
2013-01-04     Iran       345    34
2013-01-05       SA       222    56
2013-01-06      Aus       123    29

In [30]:
list('aaa')

['a', 'a', 'a']

In [59]:
df2 = pd.DataFrame({'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=range(4)),
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo' })
df2

     A          B  C  D      E    F
0  1.0 2013-01-02  1  3   test  foo
1  1.0 2013-01-02  1  3  train  foo
2  1.0 2013-01-02  1  3   test  foo
3  1.0 2013-01-02  1  3  train  foo

In [60]:
type(df2[0:3])

pandas.core.frame.DataFrame

In [63]:
df.loc[:,['A']]

KeyError: 'Passing list-likes to .loc or [] with any missing labels is no longer supported, see https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike'

dates = pd.date_range('20130101', periods=6)
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

In [83]:
df.iloc[::2,::2]=24
df

                    A         B          C         D
2013-01-01  24.000000 -0.337304  24.000000 -0.361399
2013-01-02   1.363328 -1.043289   0.512225  0.624822
2013-01-03  24.000000 -0.676390  24.000000  0.474787
2013-01-04  -0.136480 -0.326244  -1.637285  1.863765
2013-01-05  24.000000 -0.469921  24.000000  0.861337
2013-01-06   0.562589 -1.581328   0.492666  0.841882

In [90]:
df.sort_values(by=['A','C'],ascending=[True,False])

                    A         B          C         D
2013-01-04  -0.136480 -0.326244  -1.637285  1.863765
2013-01-06   0.562589 -1.581328   0.492666  0.841882
2013-01-02   1.363328 -1.043289   0.512225  0.624822
2013-01-01  24.000000 -0.337304  24.000000 -0.361399
2013-01-03  24.000000 -0.676390  24.000000  0.474787
2013-01-05  24.000000 -0.469921  24.000000  0.861337

In [3]:
dates = pd.date_range('20130101', periods=6)
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  1.474298  0.587159 -2.488448  0.639600
2013-01-02  2.539427  0.371369 -0.938999 -0.352100
2013-01-03  0.450302  0.087798 -1.010302  0.187110
2013-01-04 -1.949245  1.843355 -1.011248  0.745260
2013-01-05 -0.558869 -0.641197  1.349314  0.216389
2013-01-06  1.483696  1.046822 -0.497030 -0.594097

In [8]:
df.sort_values(by=['20130104'],ascending=False,axis=1)

                   B         D         C         A
2013-01-01  0.587159  0.639600 -2.488448  1.474298
2013-01-02  0.371369 -0.352100 -0.938999  2.539427
2013-01-03  0.087798  0.187110 -1.010302  0.450302
2013-01-04  1.843355  0.745260 -1.011248 -1.949245
2013-01-05 -0.641197  0.216389  1.349314 -0.558869
2013-01-06  1.046822 -0.594097 -0.497030  1.483696

In [12]:
df.at['20130104','D']

0.7452596119524655

In [16]:
df=df.reindex(index=df.index[0:4],columns=list(df.columns)+['G']).copy()

In [17]:
df

                   A         B         C        D   G
2013-01-01  1.474298  0.587159 -2.488448  0.63960 NaN
2013-01-02  2.539427  0.371369 -0.938999 -0.35210 NaN
2013-01-03  0.450302  0.087798 -1.010302  0.18711 NaN
2013-01-04 -1.949245  1.843355 -1.011248  0.74526 NaN

In [19]:
df.iloc[:,4]=[2,3,5,7]
df

                   A         B         C        D  G
2013-01-01  1.474298  0.587159 -2.488448  0.63960  2
2013-01-02  2.539427  0.371369 -0.938999 -0.35210  3
2013-01-03  0.450302  0.087798 -1.010302  0.18711  5
2013-01-04 -1.949245  1.843355 -1.011248  0.74526  7

In [20]:
df2 = pd.DataFrame({'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=range(4)),
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo' })

In [21]:
df2.reindex(index=list(df2.index)+[5])

     A          B    C    D      E    F
0  1.0 2013-01-02  1.0  3.0   test  foo
1  1.0 2013-01-02  1.0  3.0  train  foo
2  1.0 2013-01-02  1.0  3.0   test  foo
3  1.0 2013-01-02  1.0  3.0  train  foo
5  NaN        NaT  NaN  NaN    NaN  NaN

In [34]:
max(df.iloc[:,1])

1.8433552273068599

In [35]:
import pandas as pd

dfe = pd.read_csv('olympics.csv', index_col=0, skiprows=1)

for col in df.columns:
    if col[:2]=='01':
        dfe.rename(columns={col:'Gold'}, inplace=True)
    if col[:2]=='02':
        dfe.rename(columns={col:'Silver'+col[4:]}, inplace=True)
    if col[:2]=='03':
        dfe.rename(columns={col:'Bronze'+col[4:]}, inplace=True)
    if col[:1]=='№':
        dfe.rename(columns={col:'#'+col[1:]}, inplace=True)

names_ids = dfe.index.str.split('\s\(') # split the index by '('
dfe.index = names_ids.str[0] # the [0] element is the country name (new index) 
dfe['ID'] = names_ids.str[1].str[:3] # the [1] element is the abbreviation or ID (take first 3 characters from that)
dfe = dfe.drop('Totals')
dfe.head()
dfe

,№ Summer,01 !,02 !,03 !,Total,№ Winter,01 !.1,02 !.1,03 !.1,Total.1,№ Games,01 !.2,02 !.2,03 !.2,Combined total,ID
Afghanistan,13,0,0,2,2,0,0,0,0,0,13,0,0,2,2,AFG
Algeria,12,5,2,8,15,3,0,0,0,0,15,5,2,8,15,ALG
Argentina,23,18,24,28,70,18,0,0,0,0,41,18,24,28,70,ARG
Armenia,5,1,2,9,12,6,0,0,0,0,11,1,2,9,12,ARM
Australasia,2,3,4,5,12,0,0,0,0,0,2,3,4,5,12,ANZ
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
Yugoslavia,16,26,29,28,83,14,0,3,1,4,30,26,32,29,87,YUG
Independent Olympic Participants,1,0,1,2,3,0,0,0,0,0,1,0,1,2,3,IOP
Zambia,12,0,1,1,2,0,0,0,0,0,12,0,1,1,2,ZAM
Zimbabwe,12,3,4,1,8,1,0,0,0,0,13,3,4,1,8,ZIM
Mixed team,3,8,5,4,17,0,0,0,0,0,3,8,5,4,17,ZZX

In [63]:
(dfe.iloc[:,1]).idxmax()

'United States'

In [98]:
P=dfe.iloc[:,11]*3+dfe.iloc[:,12]*2+dfe.iloc[:,13]
P.name="Points"
P

Afghanistan                           2
Algeria                              27
Argentina                           130
Armenia                              16
Australasia                          22
                                   ...
Yugoslavia                          171
Independent Olympic Participants      4
Zambia                                3
Zimbabwe                             18
Mixed team                           38
Name: Points, Length: 146, dtype: int64

IndexError: too many indices for array

In [122]:
x=dfe[dfe.iloc[:,1]>0].copy()
y=dfe[dfe.iloc[:,6]>0].copy()

In [121]:
x

,№ Summer,01 !,02 !,03 !,Total,№ Winter,01 !.1,02 !.1,03 !.1,Total.1,№ Games,01 !.2,02 !.2,03 !.2,Combined total,ID
Algeria,12,5,2,8,15,3,0,0,0,0,15,5,2,8,15,ALG
Argentina,23,18,24,28,70,18,0,0,0,0,41,18,24,28,70,ARG
Armenia,5,1,2,9,12,6,0,0,0,0,11,1,2,9,12,ARM
Australasia,2,3,4,5,12,0,0,0,0,0,2,3,4,5,12,ANZ
Australia,25,139,152,177,468,18,5,3,4,12,43,144,155,181,480,AUS
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
Uzbekistan,5,5,5,10,20,6,1,0,0,1,11,6,5,10,21,UZB
Venezuela,17,2,2,8,12,4,0,0,0,0,21,2,2,8,12,VEN
Yugoslavia,16,26,29,28,83,14,0,3,1,4,30,26,32,29,87,YUG
Zimbabwe,12,3,4,1,8,1,0,0,0,0,13,3,4,1,8,ZIM
Mixed team,3,8,5,4,17,0,0,0,0,0,3,8,5,4,17,ZZX

In [129]:
df

                   A         B         C        D  G
2013-01-01  1.474298  0.587159 -2.488448  0.63960  2
2013-01-02  2.539427  0.371369 -0.938999 -0.35210  3
2013-01-03  0.450302  0.087798 -1.010302  0.18711  5
2013-01-04 -1.949245  1.843355 -1.011248  0.74526  7

In [139]:
df['A'].apply(lambda x:x**2)

2013-01-01    2.173555
2013-01-02    6.448689
2013-01-03    0.202771
2013-01-04    3.799556
Freq: D, Name: A, dtype: float64

Histograms

In [141]:
spp=pd.Series(np.random.randint(1,7,size=11))
spp

0     3
1     2
2     4
3     1
4     4
5     3
6     3
7     6
8     5
9     4
10    1
dtype: int32

In [142]:
spp.value_counts()

4    3
3    3
1    2
6    1
5    1
2    1
dtype: int64

In [145]:
ty=pd.cut(spp,5)
ty

0       (2.0, 3.0]
1     (0.995, 2.0]
2       (3.0, 4.0]
3     (0.995, 2.0]
4       (3.0, 4.0]
5       (2.0, 3.0]
6       (2.0, 3.0]
7       (5.0, 6.0]
8       (4.0, 5.0]
9       (3.0, 4.0]
10    (0.995, 2.0]
dtype: category
Categories (5, interval[float64]): [(0.995, 2.0] < (2.0, 3.0] < (3.0, 4.0] < (4.0, 5.0] < (5.0, 6.0]]

In [153]:
dt=dfe[(dfe.iloc[:,1]>0) & (dfe.iloc[:,6]>0)]

In [156]:
(abs(dt.iloc[:,1]-dt.iloc[:,6])/dt.iloc[:,11]).idxmax()

'Bulgaria'

In [157]:
df

                   A         B         C        D  G
2013-01-01  1.474298  0.587159 -2.488448  0.63960  2
2013-01-02  2.539427  0.371369 -0.938999 -0.35210  3
2013-01-03  0.450302  0.087798 -1.010302  0.18711  5
2013-01-04 -1.949245  1.843355 -1.011248  0.74526  7

'D'

In [176]:
df.apply(np.sin,axis=1,result_type='expand')

                   A         B         C         D         G
2013-01-01  0.995348  0.553998 -0.607687  0.596874  0.909297
2013-01-02  0.566429  0.362892 -0.806967 -0.344870  0.141120
2013-01-03  0.435237  0.087685 -0.846992  0.186021 -0.958924
2013-01-04 -0.929239  0.963085 -0.847495  0.678163  0.656987

In [177]:
df.apply(lambda x: x.max() - x.min(), axis=1)

2013-01-01    4.488448
2013-01-02    3.938999
2013-01-03    6.010302
2013-01-04    8.949245
Freq: D, dtype: float64

In [198]:
df.iloc[:,0].max()-df.iloc[:,0].min()

4.488671820515038

In [199]:
2-(-2.488448)

4.488448

In [195]:
def func(a):
        print(a.max()-a.min())
for i in df.columns:
    func(df[i])

4.488671820515038
1.7555576745755475
1.5494497197883381
1.097360025676362
5

In [259]:
s = pd.Series(np.random.randint(0, 7, size=10))
s.value_counts?

In [204]:
s

0    6
1    1
2    6
3    0
4    4
5    1
6    4
7    0
8    2
9    1
dtype: int32

In [207]:
facti=pd.cut(s,6)
facti

0       (5.0, 6.0]
1    (-0.006, 1.0]
2       (5.0, 6.0]
3       (3.0, 4.0]
4       (2.0, 3.0]
5    (-0.006, 1.0]
6       (1.0, 2.0]
7       (5.0, 6.0]
8    (-0.006, 1.0]
9       (3.0, 4.0]
dtype: category
Categories (6, interval[float64]): [(-0.006, 1.0] < (1.0, 2.0] < (2.0, 3.0] < (3.0, 4.0] < (4.0, 5.0] < (5.0, 6.0]]

In [208]:
pd.cut?

In [211]:
df.groupby('A').max()

                  B         C        D  G
A
-1.949245  1.843355 -1.011248  0.74526  7
 0.450302  0.087798 -1.010302  0.18711  5
 1.474298  0.587159 -2.488448  0.63960  2
 2.539427  0.371369 -0.938999 -0.35210  3

In [220]:
df.groupby("A").apply(lambda x:x.nlargest(2,['D','G']))

                             A         B         C        D  G
A
-1.949245 2013-01-04 -1.949245  1.843355 -1.011248  0.74526  7
 0.450302 2013-01-03  0.450302  0.087798 -1.010302  0.18711  5
 1.474298 2013-01-01  1.474298  0.587159 -2.488448  0.63960  2
 2.539427 2013-01-02  2.539427  0.371369 -0.938999 -0.35210  3

In [219]:
df

                   A         B         C        D  G
2013-01-01  1.474298  0.587159 -2.488448  0.63960  2
2013-01-02  2.539427  0.371369 -0.938999 -0.35210  3
2013-01-03  0.450302  0.087798 -1.010302  0.18711  5
2013-01-04 -1.949245  1.843355 -1.011248  0.74526  7

In [221]:
d = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar'],'B' : ['one', 'one', 'two', 'three'],'C' : np.random.randn(4),'D' : np.random.randn(4)})

In [222]:
d

     A      B         C         D
0  foo    one -1.557316 -2.188437
1  bar    one  0.983369 -0.105650
2  foo    two  1.627079 -1.314832
3  bar  three -0.341302 -1.353662

In [225]:
d.groupby("A").apply(lambda x:x.nlargest(2,['D','C']))

         A      B         C         D
A
bar 1  bar    one  0.983369 -0.105650
    3  bar  three -0.341302 -1.353662
foo 2  foo    two  1.627079 -1.314832
    0  foo    one -1.557316 -2.188437

In [238]:
d.iloc[2,2]=-2.188437

In [239]:
d

     A      B         C         D
0  foo    one -1.557316 -2.188437
1  bar    one  0.983369 -0.105650
2  foo    two -2.188437 -1.314832
3  bar  three -0.341302 -1.353662

In [258]:
d.groupby("A").apply(lambda x:x.nlargest(1,['D'])).sum()

A     barfoo
B     onetwo
C   -1.20507
D   -1.42048
dtype: object

In [254]:
d[(d.A=='bar') & (d.B=='one')].groupby(['A','B']).sum()

                C        D
A   B
bar one  0.983369 -0.10565

In [235]:
-1.314832 > -2.188437

True

In [255]:
d[(d.A=='bar') & (d.B=='one')].sum()

A         bar
B         one
C    0.983369
D    -0.10565
dtype: object